REM	Эта утилита предназначена для отправки файлов данных на весы
REM     SM100/300/500/700
REM
REM     Синтаксис: 
REM	_отпр_все.bat AAA 
REM     где AAA - имя или IP-адрес весов


call отпр_plu.bat %1
call отпр_основн_грп.bat %1
call отпр_прокрутки.bat %1
call отпр_спец_сообщений.bat %1
REM call отпр_файла_весов.bat %1
call отпр_файла_ингредиентов.bat %1
call отпр_файла_места.bat %1
call отпр_файла_названия_магазина.bat %1
call отпр_файла_назначеных_клавиш.bat %1
call отпр_файла_операторов.bat %1
call отпр_файла_отдела.bat %1
call отпр_файла_рекламы.bat %1
call отпр_файла_текстов.bat %1
call отпр_формата_печати.bat %1
call отпр_лого.bat %1
call отпр_рисунков.bat %1
