REM	Эта утилита предназначена для получения файлов данных с весов 
REM     SM100/300/500/700
REM
REM     Синтаксис: 
REM	_получ_все.bat AAA 
REM     где AAA - имя или IP-адрес весов


call получ_PLU.bat %1
call получ_основн_грп.bat %1
call получ_прокрутки.bat %1
call получ_файла_весов.bat %1
call получ_файла_ингредиентов.bat %1
call получ_файла_места.bat %1
call получ_файла_названия_магазина.bat %1
call получ_файла_назначеных_клавиш.bat %1
call получ_файла_отдела.bat %1
call получ_файла_рекламы.bat %1
call получ_файла_спец_сообщений.bat %1
call получ_файла_текстов.bat %1
call получ_формата_печати.bat %1
call получ_файла_операторов.bat %1
call получ_лого.bat %1
call получ_рисунков.bat %1